busanOpenFOAMDataset/caseTemplate/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     interFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         60;

deltaT          0.001;

writeControl    adjustableRunTime;
writeInterval   2;

purgeWrite      0;

writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;
maxCo           0.5;
maxAlphaCo      0.5;
maxDeltaT       0.05;
